---
kind: other
id: Methods.T:Autodesk.Revit.DB.Lighting.LightFamily
source: html/972ae845-f9e0-dd77-52e8-4f500511e172.htm
---
# LightFamily Methods

Returns a LightDistributionStyle value for the light distribution